gillwei/XMAX_rt1172/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v8.0
processor: MIMXRT1176xxxxx
package_id: MIMXRT1176AVM8A
mcu_data: ksdk2_0
processor_version: 0.8.1
pin_labels:
- {pin_num: B15, pin_signal: GPIO_SD_B1_04, label: TFT_RESET, identifier: TFT_RESET}
- {pin_num: C15, pin_signal: GPIO_SD_B1_02, label: TFT_CONNECTED, identifier: TFT_CONNECTED}
- {pin_num: M17, pin_signal: GPIO_AD_29, label: TFT_BL_PWM, identifier: TFT_BL_PWM}
- {pin_num: D15, pin_signal: GPIO_SD_B1_01, label: TFT_ASIL, identifier: TFT_ASIL}
- {pin_num: L17, pin_signal: GPIO_AD_28, label: CAN_STBY, identifier: CAN_STBY}
- {pin_num: R9, pin_signal: GPIO_SNVS_07, label: IGN_WAKE_GPIO, identifier: IGN_WAKE_GPIO}
- {pin_num: T17, pin_signal: GPIO_AD_07, label: VBATT_SENSE}
- {pin_num: R17, pin_signal: GPIO_AD_10, label: VDD_3.3V_PGOOD}
- {pin_num: P16, pin_signal: GPIO_AD_11, label: 5V_CAN_PGOOD, identifier: CAN_PGOOD}
- {pin_num: R16, pin_signal: GPIO_AD_09, label: VDD_3.3VON_PGOOD}
- {pin_num: M13, pin_signal: GPIO_AD_04, label: WDOG_B}
- {pin_num: P6, pin_signal: GPIO_LPSR_02, label: BOOT_MODE0}
- {pin_num: T7, pin_signal: GPIO_LPSR_03, label: BOOT_MODE1}
- {pin_num: N16, pin_signal: GPIO_AD_27, label: 5V_CAN_EN, identifier: d;VDD5V_CAN_EN;CAN_EN}
- {pin_num: J14, pin_signal: GPIO_SD_B2_01, label: DEBUG_LED, identifier: DEBUG_LED}
- {pin_num: N12, pin_signal: GPIO_AD_00, label: BT_UART_TX}
- {pin_num: R14, pin_signal: GPIO_AD_01, label: BT_UART_RX}
- {pin_num: R13, pin_signal: GPIO_AD_02, label: BT_UART_CTS}
- {pin_num: P15, pin_signal: GPIO_AD_03, label: BT_UART_RTS}
- {pin_num: K17, pin_signal: GPIO_AD_30, label: CAN_TX}
- {pin_num: J17, pin_signal: GPIO_AD_31, label: CAN_RX}
- {pin_num: K16, pin_signal: GPIO_AD_32, label: EEPROM_I2C_SCL}
- {pin_num: H17, pin_signal: GPIO_AD_33, label: EEPROM_I2C_SDA}
- {pin_num: P8, pin_signal: GPIO_LPSR_06, label: DEBUG_UART_TX}
- {pin_num: R8, pin_signal: GPIO_LPSR_07, label: DEBUG_UART_RX}
- {pin_num: R5, pin_signal: GPIO_LPSR_10, label: JTAG_NRST}
- {pin_num: T5, pin_signal: GPIO_LPSR_11, label: JTAG_TDO/SWO}
- {pin_num: U5, pin_signal: GPIO_LPSR_12, label: JTAG_TDI}
- {pin_num: U6, pin_signal: GPIO_LPSR_13, label: JTAG_MOD}
- {pin_num: T6, pin_signal: GPIO_LPSR_14, label: JTAG_TCK_SWCLK}
- {pin_num: U7, pin_signal: GPIO_LPSR_15, label: JTAG_TMS_SWDIO}
- {pin_num: J15, pin_signal: GPIO_SD_B2_00, label: TFT_SPI_SCK}
- {pin_num: H13, pin_signal: GPIO_SD_B2_02, label: TFT_SPI_SISO}
- {pin_num: E14, pin_signal: GPIO_SD_B2_05, label: QSPI DQS}
- {pin_num: F17, pin_signal: GPIO_SD_B2_06, label: FLEXSPI_CS}
- {pin_num: G14, pin_signal: GPIO_SD_B2_07, label: FLEXSPI_SCK}
- {pin_num: F15, pin_signal: GPIO_SD_B2_08, label: FLEXSPI_D0}
- {pin_num: H15, pin_signal: GPIO_SD_B2_09, label: FLEXSPI_D1}
- {pin_num: H14, pin_signal: GPIO_SD_B2_10, label: FLEXSPI_D2}
- {pin_num: F16, pin_signal: GPIO_SD_B2_11, label: FLEXSPI_D3}
- {pin_num: U9, pin_signal: PMIC_ON_REQ, label: SYS_EN, identifier: SYS_EN}
- {pin_num: T9, pin_signal: PMIC_STBY_REQ, label: PMIC_STBY_REQ}
- {pin_num: T8, pin_signal: WAKEUP, label: IGN_WAKE, identifier: IGN_WAKE}
- {pin_num: E13, pin_signal: GPIO_DISP_B1_00, label: TFT_RGB_CLK}
- {pin_num: D13, pin_signal: GPIO_DISP_B1_01, label: TFT_RGB_DE, identifier: LCDIF_ENABLE}
- {pin_num: D11, pin_signal: GPIO_DISP_B1_02, label: TFT_RGB_HSYNC}
- {pin_num: E11, pin_signal: GPIO_DISP_B1_03, label: TFT_RGB_VSYNC}
- {pin_num: E10, pin_signal: GPIO_DISP_B1_04, label: TFT_RGB_B0}
- {pin_num: C11, pin_signal: GPIO_DISP_B1_05, label: TFT_RGB_B1}
- {pin_num: D10, pin_signal: GPIO_DISP_B1_06, label: TFT_RGB_B2}
- {pin_num: E12, pin_signal: GPIO_DISP_B1_07, label: TFT_RGB_B3}
- {pin_num: A15, pin_signal: GPIO_DISP_B1_08, label: TFT_RGB_B4}
- {pin_num: C13, pin_signal: GPIO_DISP_B1_09, label: TFT_RGB_B5}
- {pin_num: B14, pin_signal: GPIO_DISP_B1_10, label: TFT_RGB_B6}
- {pin_num: A14, pin_signal: GPIO_DISP_B1_11, label: TFT_RGB_B7}
- {pin_num: E8, pin_signal: GPIO_DISP_B2_00, label: TFT_RGB_G0}
- {pin_num: F8, pin_signal: GPIO_DISP_B2_01, label: TFT_RGB_G1}
- {pin_num: E9, pin_signal: GPIO_DISP_B2_02, label: TFT_RGB_G2}
- {pin_num: D7, pin_signal: GPIO_DISP_B2_03, label: TFT_RGB_G3}
- {pin_num: C7, pin_signal: GPIO_DISP_B2_04, label: TFT_RGB_G4}
- {pin_num: C9, pin_signal: GPIO_DISP_B2_05, label: TFT_RGB_G5}
- {pin_num: C6, pin_signal: GPIO_DISP_B2_06, label: TFT_RGB_G6}
- {pin_num: D6, pin_signal: GPIO_DISP_B2_07, label: TFT_RGB_G7}
- {pin_num: B5, pin_signal: GPIO_DISP_B2_08, label: TFT_RGB_R0}
- {pin_num: D8, pin_signal: GPIO_DISP_B2_09, label: TFT_RGB_R1}
- {pin_num: D9, pin_signal: GPIO_DISP_B2_10, label: TFT_RGB_R2}
- {pin_num: A6, pin_signal: GPIO_DISP_B2_11, label: TFT_RGB_R3}
- {pin_num: B6, pin_signal: GPIO_DISP_B2_12, label: TFT_RGB_R4}
- {pin_num: A5, pin_signal: GPIO_DISP_B2_13, label: TFT_RGB_R5}
- {pin_num: A7, pin_signal: GPIO_DISP_B2_14, label: TFT_RGB_R6}
- {pin_num: A4, pin_signal: GPIO_DISP_B2_15, label: TFT_RGB_R7}
- {pin_num: F3, pin_signal: GPIO_EMC_B1_00, label: SDRAM_SEMC_D0}
- {pin_num: F2, pin_signal: GPIO_EMC_B1_01, label: SDRAM_SEMC_D1}
- {pin_num: G4, pin_signal: GPIO_EMC_B1_02, label: SDRAM_SEMC_D2}
- {pin_num: E4, pin_signal: GPIO_EMC_B1_03, label: SDRAM_SEMC_D3}
- {pin_num: H5, pin_signal: GPIO_EMC_B1_04, label: SDRAM_SEMC_D4}
- {pin_num: F4, pin_signal: GPIO_EMC_B1_05, label: SDRAM_SEMC_D5}
- {pin_num: H4, pin_signal: GPIO_EMC_B1_06, label: SDRAM_SEMC_D6}
- {pin_num: H3, pin_signal: GPIO_EMC_B1_07, label: SDRAM_SEMC_D7}
- {pin_num: F5, pin_signal: GPIO_EMC_B1_08, label: SDRAM_SEMC_DQML}
- {pin_num: A3, pin_signal: GPIO_EMC_B1_09, label: SDRAM_SEMC_A0}
- {pin_num: A2, pin_signal: GPIO_EMC_B1_10, label: SDRAM_SEMC_A1}
- {pin_num: C2, pin_signal: GPIO_EMC_B1_11, label: SDRAM_SEMC_A2}
- {pin_num: C5, pin_signal: GPIO_EMC_B1_12, label: SDRAM_SEMC_A3}
- {pin_num: D5, pin_signal: GPIO_EMC_B1_13, label: SDRAM_SEMC_A4}
- {pin_num: B1, pin_signal: GPIO_EMC_B1_14, label: SDRAM_SEMC_A5}
- {pin_num: C1, pin_signal: GPIO_EMC_B1_15, label: SDRAM_SEMC_A6}
- {pin_num: D3, pin_signal: GPIO_EMC_B1_16, label: SDRAM_SEMC_A7}
- {pin_num: B3, pin_signal: GPIO_EMC_B1_17, label: SDRAM_SEMC_A8}
- {pin_num: B4, pin_signal: GPIO_EMC_B1_18, label: SDRAM_SEMC_A9}
- {pin_num: C4, pin_signal: GPIO_EMC_B1_19, label: SDRAM_SEMC_A11}
- {pin_num: G2, pin_signal: GPIO_EMC_B1_21, label: SDRAM_SEMC_BA0}
- {pin_num: H2, pin_signal: GPIO_EMC_B1_22, label: SDRAM_SEMC_BA1}
- {pin_num: B2, pin_signal: GPIO_EMC_B1_23, label: SDRAM_SEMC_A10}
- {pin_num: J5, pin_signal: GPIO_EMC_B1_24, label: SDRAM_SEMC_CAS}
- {pin_num: J4, pin_signal: GPIO_EMC_B1_25, label: SDRAM_SEMC_RAS}
- {pin_num: J3, pin_signal: GPIO_EMC_B1_26, label: SDRAM_SEMC_CLK}
- {pin_num: G5, pin_signal: GPIO_EMC_B1_27, label: SDRAM_SEMC_CKE}
- {pin_num: E5, pin_signal: GPIO_EMC_B1_28, label: SDRAM_SEMC_WE}
- {pin_num: E6, pin_signal: GPIO_EMC_B1_29, label: SDRAM_SEMC_CS0}
- {pin_num: E3, pin_signal: GPIO_EMC_B1_30, label: SDRAM_SEMC_D8}
- {pin_num: D2, pin_signal: GPIO_EMC_B1_31, label: SDRAM_SEMC_D9}
- {pin_num: E2, pin_signal: GPIO_EMC_B1_33, label: SDRAM_SEMC_D11}
- {pin_num: E1, pin_signal: GPIO_EMC_B1_34, label: SDRAM_SEMC_D12}
- {pin_num: F1, pin_signal: GPIO_EMC_B1_35, label: SDRAM_SEMC_D13}
- {pin_num: G1, pin_signal: GPIO_EMC_B1_36, label: SDRAM_SEMC_D14}
- {pin_num: H1, pin_signal: GPIO_EMC_B1_37, label: SDRAM_SEMC_D15}
- {pin_num: J1, pin_signal: GPIO_EMC_B1_38, label: SDRAM_SEMC_DQMH}
- {pin_num: D1, pin_signal: GPIO_EMC_B1_32, label: SDRAM_SEMC_D10}
- {pin_num: R1, pin_signal: GPIO_EMC_B2_03, label: HW_ID0, identifier: HW_ID0}
- {pin_num: P1, pin_signal: GPIO_EMC_B2_08, label: HW_ID3, identifier: HW_ID3}
- {pin_num: N1, pin_signal: GPIO_EMC_B2_05, label: HW_ID2, identifier: HW_ID2}
- {pin_num: M1, pin_signal: GPIO_EMC_B2_04, label: HW_ID1, identifier: HW_ID1}
- {pin_num: R2, pin_signal: GPIO_EMC_B2_10, label: SKU_ID1, identifier: SKU_ID1}
- {pin_num: P2, pin_signal: GPIO_EMC_B2_16, label: SKU_ID3, identifier: SKU_ID3}
- {pin_num: N2, pin_signal: GPIO_EMC_B2_09, label: SKU_ID0, identifier: SKU_ID0}
- {pin_num: M2, pin_signal: GPIO_EMC_B2_12, label: SKU_ID2, identifier: SKU_ID2}
- {pin_num: N17, pin_signal: GPIO_AD_16, label: TFT_TEMPERATURE}
- {pin_num: P17, pin_signal: GPIO_AD_12, label: PCBA_TEMPERATURE}
- {pin_num: P13, pin_signal: GPIO_AD_05, label: BT_WAKE_HOST}
- {pin_num: R15, pin_signal: GPIO_AD_08, label: BT_RST_N}
- {pin_num: F14, pin_signal: GPIO_SD_B2_04, label: TFT_SPI_CSB}
- {pin_num: B16, pin_signal: GPIO_SD_B1_00, label: TFT_BL_EN, identifier: TFT_BL_EN}
- {pin_num: B17, pin_signal: GPIO_SD_B1_03, label: TFT_RESET, identifier: TFT_RESET}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

