gillwei/XMAX_rt1172/board/pin_mux.c
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_04_LPSPI4_PCS1,       /* GPIO_SD_B2_04 is configured as LPSPI4_PCS1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_LPSR_02_SRC_BOOT_MODE00,    /* GPIO_LPSR_02 is configured as SRC_BOOT_MODE00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_LPSR_03_SRC_BOOT_MODE01,    /* GPIO_LPSR_03 is configured as SRC_BOOT_MODE01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_LPSR_06_LPUART12_TXD,       /* GPIO_LPSR_06 is configured as LPUART12_TXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_LPSR_07_LPUART12_RXD,       /* GPIO_LPSR_07 is configured as LPUART12_RXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SNVS_07_DIG_GPIO13_IO10,    /* GPIO_SNVS_07_DIG is configured as GPIO13_IO10 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_PMIC_ON_REQ_DIG_GPIO13_IO01,     /* PMIC_ON_REQ_DIG is configured as GPIO13_IO01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_PMIC_STBY_REQ_DIG_GPIO13_IO02,   /* PMIC_STBY_REQ_DIG is configured as GPIO13_IO02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_WAKEUP_DIG_GPIO13_IO00,          /* WAKEUP_DIG is configured as GPIO13_IO00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLcdifPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: E13, peripheral: LCDIF, signal: lcdif_clk, pin_signal: GPIO_DISP_B1_00, pull_down_pull_up_config: Pull_Up, pdrv_config: Normal_Driver}
  - {pin_num: E10, peripheral: LCDIF, signal: 'lcdif_data, 00', pin_signal: GPIO_DISP_B1_04, pull_down_pull_up_config: Pull_Up, pdrv_config: Normal_Driver}
  - {pin_num: C11, peripheral: LCDIF, signal: 'lcdif_data, 01', pin_signal: GPIO_DISP_B1_05, pull_down_pull_up_config: Pull_Up, pdrv_config: Normal_Driver}
  - {pin_num: D10, peripheral: LCDIF, signal: 'lcdif_data, 02', pin_signal: GPIO_DISP_B1_06, pull_down_pull_up_config: Pull_Up, pdrv_config: Normal_Driver}
  - {pin_num: E12, peripheral: LCDIF, signal: 'lcdif_data, 03', pin_signal: GPIO_DISP_B1_07, pull_down_pull_up_config: Pull_Up, pdrv_config: Normal_Driver}
  - {pin_num: A15, peripheral: LCDIF, signal: 'lcdif_data, 04', pin_signal: GPIO_DISP_B1_08, pull_down_pull_up_config: Pull_Up, pdrv_config: Normal_Driver}
  - {pin_num: C13, peripheral: LCDIF, signal: 'lcdif_data, 05', pin_signal: GPIO_DISP_B1_09, pull_down_pull_up_config: Pull_Up, pdrv_config: Normal_Driver}
  - {pin_num: B14, peripheral: LCDIF, signal: 'lcdif_data, 06', pin_signal: GPIO_DISP_B1_10, pull_down_pull_up_config: Pull_Up, pdrv_config: Normal_Driver}
  - {pin_num: A14, peripheral: LCDIF, signal: 'lcdif_data, 07', pin_signal: GPIO_DISP_B1_11, pull_down_pull_up_config: Pull_Up, pdrv_config: Normal_Driver}
  - {pin_num: E8, peripheral: LCDIF, signal: 'lcdif_data, 08', pin_signal: GPIO_DISP_B2_00, pull_up_down_config: Pull_Up, drive_strength: Normal}
  - {pin_num: F8, peripheral: LCDIF, signal: 'lcdif_data, 09', pin_signal: GPIO_DISP_B2_01, pull_up_down_config: Pull_Up, drive_strength: Normal}
  - {pin_num: E9, peripheral: LCDIF, signal: 'lcdif_data, 10', pin_signal: GPIO_DISP_B2_02, pull_up_down_config: Pull_Up, drive_strength: Normal}
  - {pin_num: D7, peripheral: LCDIF, signal: 'lcdif_data, 11', pin_signal: GPIO_DISP_B2_03, pull_up_down_config: Pull_Up, drive_strength: Normal}
  - {pin_num: C7, peripheral: LCDIF, signal: 'lcdif_data, 12', pin_signal: GPIO_DISP_B2_04, pull_up_down_config: Pull_Up, drive_strength: Normal}
  - {pin_num: C9, peripheral: LCDIF, signal: 'lcdif_data, 13', pin_signal: GPIO_DISP_B2_05, pull_up_down_config: Pull_Up, drive_strength: Normal}
  - {pin_num: C6, peripheral: LCDIF, signal: 'lcdif_data, 14', pin_signal: GPIO_DISP_B2_06, pull_up_down_config: Pull_Up, drive_strength: Normal}
  - {pin_num: D6, peripheral: LCDIF, signal: 'lcdif_data, 15', pin_signal: GPIO_DISP_B2_07, pull_up_down_config: Pull_Up, drive_strength: Normal}
  - {pin_num: B5, peripheral: LCDIF, signal: 'lcdif_data, 16', pin_signal: GPIO_DISP_B2_08, pull_up_down_config: Pull_Up, drive_strength: Normal}
  - {pin_num: D8, peripheral: LCDIF, signal: 'lcdif_data, 17', pin_signal: GPIO_DISP_B2_09, pull_up_down_config: Pull_Up, drive_strength: Normal}
  - {pin_num: D9, peripheral: LCDIF, signal: 'lcdif_data, 18', pin_signal: GPIO_DISP_B2_10, pull_up_down_config: Pull_Up, drive_strength: Normal}
  - {pin_num: A6, peripheral: LCDIF, signal: 'lcdif_data, 19', pin_signal: GPIO_DISP_B2_11, pull_up_down_config: Pull_Up, drive_strength: Normal}
  - {pin_num: B6, peripheral: LCDIF, signal: 'lcdif_data, 20', pin_signal: GPIO_DISP_B2_12, pull_up_down_config: Pull_Up, drive_strength: Normal}
  - {pin_num: A5, peripheral: LCDIF, signal: 'lcdif_data, 21', pin_signal: GPIO_DISP_B2_13, pull_up_down_config: Pull_Up, drive_strength: Normal}
  - {pin_num: A7, peripheral: LCDIF, signal: 'lcdif_data, 22', pin_signal: GPIO_DISP_B2_14, pull_up_down_config: Pull_Up, drive_strength: Normal}
  - {pin_num: D11, peripheral: LCDIF, signal: lcdif_hsync, pin_signal: GPIO_DISP_B1_02, pdrv_config: Normal_Driver}
  - {pin_num: E11, peripheral: LCDIF, signal: lcdif_vsync, pin_signal: GPIO_DISP_B1_03, pdrv_config: Normal_Driver}
  - {pin_num: D13, peripheral: LCDIF, signal: lcdif_enable, pin_signal: GPIO_DISP_B1_01, pdrv_config: Normal_Driver}
  - {pin_num: A4, peripheral: LCDIF, signal: 'lcdif_data, 23', pin_signal: GPIO_DISP_B2_15, drive_strength: Normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

